OpenFOAM-v1812/tutorials/multiphase/interFoam/RAS/waterChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( 0 -10   2) // 0
    (20 -10   2) // 1
    ( 0  -3   2) // 2
    (20  -3   2) // 3
    ( 0   3   2) // 4
    (20   3   2) // 5
    ( 0  10   2) // 6
    (20  10   2) // 7

    ( 0 -10   8) // 8
    (20 -10   8) // 9
    ( 0  -4   8) // 10
    (20  -4   8) // 11
    ( 0   4   8) // 12
    (20   4   8) // 13
    ( 0  10   8) // 14
    (20  10   8) // 15
);

blocks
(
    hex (0 1 3 2  8  9 11 10) (20  5 20) simpleGrading (1 1 1)
    hex (2 3 5 4 10 11 13 12) (20 10 20) simpleGrading (1 1 1)
    hex (4 5 7 6 12 13 15 14) (20  5 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 3 2)
            (4 5 7 6)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (2 3 5 4)
            (0 1 9 8)
            (0 2 10 8)
            (1 3 11 9)
            (2 4 12 10)
            (5 7 15 13)
            (6 7 15 14)
            (4 6 14 12)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 5 13 11)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (8  9 11 10)
            (10 11 13 12)
            (12 13 15 14)
        );
    }
);

// ************************************************************************* //
